#### 📖 Terraform Plan ('infra-pe/resources/uat') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cgn_pe_apim.azurerm_subnet.cgn_pe_apim_subnet will be created
  + resource "azurerm_subnet" "cgn_pe_apim_subnet" {
      + address_prefixes                              = [
          + "10.26.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-u-cgn-pe-apim-snet-01"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-u-itn-cgn-pe-vnet-01"
      + service_endpoints                             = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                          = "io-u-itn-cgn-pe-rg-01"
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-attribute-authority-app-01"
        name                                           = "io-u-itn-cgn-pe-attribute-authority-app-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Uat"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-backend-app-01"
        name                                           = "io-u-itn-cgn-pe-backend-app-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Uat"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-backend-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Uat"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + min_api_version               = "2021-08-01"
      + name                          = "io-u-itn-cgn-pe-apim-apim-01"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = false
      + publisher_email               = "email@example.com"
      + publisher_name                = "Example Publisher"
      + resource_group_name           = "io-u-itn-cgn-pe-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_type          = "Internal"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up {
          + enabled = false

          + terms_of_service {
              + consent_required = false
              + enabled          = false
            }
        }

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be created
  + resource "azurerm_network_security_group" "nsg_apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-u-itn-cgn-pe-apim-apim-nsg-01"
      + resource_group_name = "io-u-itn-cgn-pe-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "managementapim"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-u-itn-cgn-pe-apim-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-u-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-u-itn-cgn-pe-apim-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-u-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-u-itn-cgn-pe-apim-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-u-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

Plan: 7 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
